#include <avr/io.h>
#include <avr/pgmspace.h>
#include <inttypes.h>

/*
 * PROGRAM NAME:  b3380
 *
 * VERSION:       1.0
 *
 * FILENAME:      b3380.hpp
 *
 * FILE CREATED:  Oct 14, 2021
 *
 * LAST MODIFIED: [14-10-21]
 *
 * DEVELOPED BY:  Andrey Dubrovin
 *                
 * DESCRIPTION:   MF52A103J3380
 *
 * FUNCTION LIST:
 *
 */

/*---------------------------------------------------------*/
/*  Global Defines                                         */
/*---------------------------------------------------------*/

// Значение температуры, возвращаемое если сумма результатов АЦП больше первого значения таблицы
#define TEMPERATURE_UNDER -550
// Значение температуры, возвращаемое если сумма результатов АЦП меньше последнего значения таблицы
#define TEMPERATURE_OVER 2490
// Значение температуры соответствующее первому значению таблицы
#define TEMPERATURE_TABLE_START -550
// Шаг таблицы 
#define TEMPERATURE_TABLE_STEP 20

// Тип каждого элемента в таблице, если сумма выходит в пределах 16 бит - uint16_t, иначе - uint32_t
typedef uint16_t temperature_table_entry_type;
// Тип индекса таблицы. Если в таблице больше 256 элементов, то uint16_t, иначе - uint8_t
typedef uint8_t temperature_table_index_type;

// Метод доступа к элементу таблицы, должен соответствовать temperature_table_entry_type
#define TEMPERATURE_TABLE_READ(i) pgm_read_word(&termo_table[i])


/* Таблица суммарного значения АЦП в зависимости от температуры. От большего значения к меньшему
   Для построения таблицы использованы следующие парамертры:
     R1(T1): 10кОм(25°С)
     B25/100: 3380
     Схема включения: A
     Ra: 10кОм
     Напряжения U0/Uref: 5В/5В
     Термистор NTC 10K 5% B3380 (MF52A103J3380)
*/
const temperature_table_entry_type termo_table[] PROGMEM = {
    1008, 1006, 1003, 1000, 997, 993, 989, 985,
    980, 974, 968, 962, 955, 947, 938, 929,
    920, 909, 898, 886, 873, 860, 846, 831,
    815, 799, 782, 765, 747, 729, 710, 691,
    671, 651, 631, 611, 591, 571, 551, 532,
    512, 493, 474, 455, 437, 419, 401, 385,
    368, 352, 337, 322, 308, 294, 281, 268,
    256, 244, 233, 223, 212, 203, 193, 184,
    176, 168, 160, 153, 146, 140, 133, 127,
    122, 116, 111, 106, 102, 97, 93, 89,
    85, 82, 78, 75, 72, 69, 66, 63,
    61, 58, 56, 54, 52, 50, 48, 46,
    44, 43, 41, 40, 38, 37, 35, 34,
    33, 32, 31, 30, 29, 28, 27, 26,
    25, 24, 23, 23, 22, 21, 20, 20,
    19, 19, 18, 17, 17, 16, 16, 15,
    15, 15, 14, 14, 13, 13, 13, 12,
    12, 12, 11, 11, 11, 10, 10, 10,
    10, 9, 9, 9, 9, 8, 8, 8,
    8
};

/*---------------------------------------------------------*/
/*  Function Protos                                        */
/*---------------------------------------------------------*/

int16_t calculateNTC(temperature_table_entry_type adcsum);
